.doom.d/packages.el
(package! theme-magic)

(package! info-colors)

(package! org-modern)

;; (package! org-roam-ui)
;; (package! websocket)

(package! org-pandoc-import
  :recipe (:host github
           :repo "tecosaur/org-pandoc-import"
           :files ("*.el" "filters" "preprocessors")))

(package! zotxt)

(package! org-chef)
