.doom.d/packages.el

(package! org-cite-csl-activate :recipe (:host github :repo "andras-simonyi/org-cite-csl-activate"))

(package! engrave-faces)

(package! doct)

(package! jinx)

;; (package! lsp-ltex)
(package! eglot-ltex :recipe (:host github :repo "emacs-languagetool/eglot-ltex"))

(package! vlfi)
